package homeWork_5;
//3. Создать класс Cat и унаследовать его от Animal
//Добавить конструктор по умолчнию
//Переопределить метод say(Вывод на экран: "Мяу")
public class Cat extends Animal{
    public Cat(){
    }
    @Override
    public String say () {
        return "Мяу";
    }
    //public void say () {
     //   System.out.println("Мяу");




}


